IDEA Connection Link
ConnectionSrv.GetNonconformities Method
 Get all nonconformities for connection
 Namespace: IdeaRS.ConnectionService.Service
 Assembly: IdeaRS.ConnectionLink (in IdeaRS.ConnectionLink.dll) Version: 10.0.1.1 (10.0.1.1)
Syntax
public INonConformityIssues GetNonconformities(
	Guid connectionId
)
Public Function GetNonconformities (
	connectionId As Guid
) As INonConformityIssues
public:
INonConformityIssues^ GetNonconformities(
	Guid connectionId
)
Parameters
connectionId
Type: System.Guid
Id of the connection, Guid.Empty for the first connection in the project
Return Value
Type: INonConformityIssues
[Missing <returns> documentation for "M:IdeaRS.ConnectionService.Service.ConnectionSrv.GetNonconformities(System.Guid)"]
See Also
Reference
ConnectionSrv Class
IdeaRS.ConnectionService.Service Namespace